Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
The ReferenceModelObjectAttribute class is a base class from where concrete attributes are derived from. The documentation about
different attributes and their function can be found from the vendor specification, for example from the IFC format specification.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.Origin
The origin of the extrusion.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.xDir
The X-axis direction.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.Extrusion
The extrusion vector.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.ProfileName
The name of the profile (often empty).

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.Name
The name of the product.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.Description
The description of the product.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute.ObjectType
The object type of the product.